// 1. 
// ******00000
// ******00000
// ******00000
// ******00000
// ******00000
// ******00000
// ******00000
// ******00000
// ******00000
// поиграть со смещением границ, поменять местами нули, добавить разделительные полосы по середине

// 2. 
// **********
// **********
// 0000000000
// **********
// **********
// **********
// **********
// **********
// **********
// **********
// Поиграть со строками и столбцами
// 3. 
// **********
// *0000*****
// *0000*****
// *0000*****
// **********
// **********
// *0000*****
// *0000*****
// *0000*****
// **********
// Попробовать сделать диагонали и потом закрасить одну часть или 2 диагонали. Толщину линий также регулировать




public class HomeWork_9 {
    public static void main(String[] args) {
        System.out.println("Hello World!");
        
    }
}
